{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.11.0", "signature": {"inputs": {"input_8": {"name": "input_8:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Reshape/shape/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/ones/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/embedding_7/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/Sqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1/stack_1/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1/stack_1/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/value/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/attention_output/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/mul_3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/dense_19/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/dense_19/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_8", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/embedding_7/Cast", "op": "Cast", "input": ["input_8"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/Shape", "op": "Shape", "input": ["input_8"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/embedding_7/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/embedding_7/Cast", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/embedding_7/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/similar_model_7/positional_embedding_7/Shape", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice/stack", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice/stack_1", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/mul", "op": "Mul", "input": ["StatefulPartitionedCall/similar_model_7/positional_embedding_7/embedding_7/embedding_lookup", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1/stack_1/0", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1/stack_1/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1", "op": "StridedSlice", "input": ["unknown_0", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1/stack", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1/stack_1", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "1"}, "begin_mask": {"i": "6"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "4"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_7/positional_embedding_7/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_7/positional_embedding_7/mul", "StatefulPartitionedCall/similar_model_7/positional_embedding_7/strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/key/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_7/positional_embedding_7/add", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/key/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/query/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_7/positional_embedding_7/add", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/query/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/value/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_7/positional_embedding_7/add", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/value/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/key/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/key/einsum/Einsum", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/key/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/query/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/query/einsum/Einsum", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/query/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/value/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/value/einsum/Einsum", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/value/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/query/add", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/key/add", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/Mul"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWVjZCxhYmNkLT5hY2Jl"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/einsum/Einsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/softmax/Softmax", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/value/add"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWNiZSxhZWNkLT5hYmNk"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/attention_output/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/einsum_1/Einsum", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/attention_output/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjZCxjZGUtPmFiZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/attention_output/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/attention_output/einsum/Einsum", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/attention_output/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/add_10/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_7/positional_embedding_7/add", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/multi_head_attention_5/attention_output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/add_10/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Shape", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_2/stack", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_2/stack_1", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Shape", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice/stack", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice/stack_1", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Shape", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_1/stack", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_1/stack_1", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Reshape/shape/0", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/mul_1", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_2", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/ones/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/mul_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/zeros/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/mul_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/add_10/add", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/ones/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/mul_1", "ConstantFolding/StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/ones/packed_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/zeros/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/mul_1", "ConstantFolding/StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/zeros/packed_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/ones", "op": "Fill", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/ones/packed", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/ones/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/zeros/packed", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Reshape", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/ones", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/zeros", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Const", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Const_1"], "attr": {"exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkNIVw=="}, "T": {"type": "DT_FLOAT"}, "U": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.001}, "is_training": {"b": true}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/FusedBatchNormV3", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Reshape_1", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/mul_3/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/mul_3", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Shape", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/axes", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Shape", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/free", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/GatherV2_1", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Const_2", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Prod", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/add", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Reshape", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/MatMul", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Shape", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/axes", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Shape", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/free", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/GatherV2_1", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Const_2", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Prod", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Relu", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Reshape", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/MatMul", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/add_11/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/add", "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_7/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/add_11/add", "StatefulPartitionedCall/similar_model_7/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_7/dense_19/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/similar_model_7/Mean", "StatefulPartitionedCall/similar_model_7/dense_19/MatMul/ReadVariableOp", "StatefulPartitionedCall/similar_model_7/dense_19/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/similar_model_7/dense_19/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_18/Tensordot/ReadVariableOp", "shape": [128, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/feed_forward_5/sequential_5/dense_17/Tensordot/ReadVariableOp", "shape": [32, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/Reshape/shape/0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_7/encoder_layer_5/global_self_attention_5/layer_normalization_10/strided_slice_2/stack_2", "shape": [1], 