{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.11.0", "signature": {"inputs": {"input_14": {"name": "input_14:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_38/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_38/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_38/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_38/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_38/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/embedding_13/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/Sqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1/stack_1/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1/stack_1/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/value/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/attention_output/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/value/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/attention_output/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_38/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_38/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_38/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_38/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_38/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/dense_39/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/dense_39/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_14", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/embedding_13/Cast", "op": "Cast", "input": ["input_14"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/Shape", "op": "Shape", "input": ["input_14"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/embedding_13/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/embedding_13/Cast", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/embedding_13/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/similar_model_13/positional_embedding_13/Shape", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice/stack", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice/stack_1", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/mul", "op": "Mul", "input": ["StatefulPartitionedCall/similar_model_13/positional_embedding_13/embedding_13/embedding_lookup", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1/stack_1/0", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1/stack_1/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1", "op": "StridedSlice", "input": ["unknown_0", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1/stack", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1/stack_1", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "6"}, "end_mask": {"i": "4"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_13/positional_embedding_13/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/positional_embedding_13/mul", "StatefulPartitionedCall/similar_model_13/positional_embedding_13/strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/key/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/positional_embedding_13/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/key/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/query/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/positional_embedding_13/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/query/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/value/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/positional_embedding_13/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/value/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/key/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/key/einsum/Einsum", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/key/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/query/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/query/einsum/Einsum", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/query/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/value/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/value/einsum/Einsum", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/value/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/query/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/key/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/Mul"], "attr": {"equation": {"s": "YWVjZCxhYmNkLT5hY2Jl"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/einsum/Einsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/softmax/Softmax", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/value/add"], "attr": {"equation": {"s": "YWNiZSxhZWNkLT5hYmNk"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/attention_output/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/einsum_1/Einsum", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/attention_output/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjZCxjZGUtPmFiZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/attention_output/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/attention_output/einsum/Einsum", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/attention_output/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/add_21/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/positional_embedding_13/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/multi_head_attention_10/attention_output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/add_21/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Shape", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/axes", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Shape", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/free", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/GatherV2_1", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Const_2", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Prod", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/add_21/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/Reshape", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/MatMul", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Tensordot", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Shape", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/axes", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Shape", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/free", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/GatherV2_1", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Const_2", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Prod", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_35/Relu", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/Reshape", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/MatMul", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/Tensordot", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/add_22/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/global_self_attention_10/add_21/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/sequential_11/dense_36/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/key/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/add_22/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/key/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/query/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/add_22/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/query/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/value/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/add_22/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/value/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/key/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/key/einsum/Einsum", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/key/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/query/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/query/einsum/Einsum", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/query/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/value/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/value/einsum/Einsum", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/value/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/query/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/key/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/Mul"], "attr": {"equation": {"s": "YWVjZCxhYmNkLT5hY2Jl"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/softmax_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/einsum/Einsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/softmax_1/Softmax", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/value/add"], "attr": {"equation": {"s": "YWNiZSxhZWNkLT5hYmNk"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/attention_output/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/einsum_1/Einsum", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/attention_output/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjZCxjZGUtPmFiZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/attention_output/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/attention_output/einsum/Einsum", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/attention_output/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/add_23/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_11/feed_forward_11/add_22/add", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/multi_head_attention_11/attention_output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/global_self_attention_11/add_23/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/Shape", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/axes", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/Shape", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/free", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/GatherV2_1", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_13/encoder_layer_12/feed_forward_12/sequential_12/dense_37/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": 