{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.11.0", "signature": {"inputs": {"input_9": {"name": "input_9:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/embedding_8/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/Sqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack_1/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack_1/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/value/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/attention_output/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/dense_22/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/dense_22/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_9", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/embedding_8/Cast", "op": "Cast", "input": ["input_9"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/Shape", "op": "Shape", "input": ["input_9"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/embedding_8/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/embedding_8/Cast", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/embedding_8/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/similar_model_8/positional_embedding_8/Shape", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice/stack", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice/stack_1", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/mul", "op": "Mul", "input": ["StatefulPartitionedCall/similar_model_8/positional_embedding_8/embedding_8/embedding_lookup", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack_1/0", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack_1/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1", "op": "StridedSlice", "input": ["unknown_0", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack_1", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "1"}, "begin_mask": {"i": "6"}, "end_mask": {"i": "4"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_8/positional_embedding_8/mul", "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/key/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_8/positional_embedding_8/add", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/key/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/query/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_8/positional_embedding_8/add", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/query/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/value/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_8/positional_embedding_8/add", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/value/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/key/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/key/einsum/Einsum", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/key/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/query/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/query/einsum/Einsum", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/query/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/value/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/value/einsum/Einsum", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/value/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/query/add", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/key/add", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/Mul"], "attr": {"equation": {"s": "YWVjZCxhYmNkLT5hY2Jl"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/einsum/Einsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/softmax/Softmax", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/value/add"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWNiZSxhZWNkLT5hYmNk"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/attention_output/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/einsum_1/Einsum", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/attention_output/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjZCxjZGUtPmFiZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/attention_output/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/attention_output/einsum/Einsum", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/attention_output/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/add_12/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_8/positional_embedding_8/add", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/attention_output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/add_12/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Shape", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/axes", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Shape", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/free", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/GatherV2_1", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Const_2", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Prod", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/add_12/add", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Reshape", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/MatMul", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Shape", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/axes", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Shape", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/free", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/GatherV2_1", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/GatherV2", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Const_2", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Prod", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Relu", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Reshape", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/MatMul", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/add_13/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/add_12/add", "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_8/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/add_13/add", "StatefulPartitionedCall/similar_model_8/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_8/dense_22/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/similar_model_8/Mean", "StatefulPartitionedCall/similar_model_8/dense_22/MatMul/ReadVariableOp", "StatefulPartitionedCall/similar_model_8/dense_22/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/similar_model_8/dense_22/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/ReadVariableOp", "shape": [128, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/ReadVariableOp", "shape": [32, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/key/einsum/Einsum/ReadVariableOp", "shape": [32, 4, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/key/add/ReadVariableOp", "shape": [4, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/query/einsum/Einsum/ReadVariableOp", "shape": [32, 4, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/query/add/ReadVariableOp", "shape": [4, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/Mul/y", "shape": [], "dtype": "float32"}, {"name": "unknown", "shape": [1000, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/embedding_8/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/Sqrt", "shape": [], "dtype": "float32"}, {"name": "unknown_0", "shape": [2048, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack_1/0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack_1/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/positional_embedding_8/strided_slice_1/stack_2", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/value/einsum/Einsum/ReadVariableOp", "shape": [32, 4, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/value/add/ReadVariableOp", "shape": [4, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/attention_output/einsum/Einsum/ReadVariableOp", "shape": [4, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/global_self_attention_6/multi_head_attention_6/attention_output/add/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_20/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/encoder_layer_6/feed_forward_6/sequential_6/dense_21/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_8/dense_22/MatMul/ReadVariableOp", "shape": [32, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_8/dense_22/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}]}]}