{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.11.0", "signature": {"inputs": {"input_4": {"name": "input_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/embedding_3/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/Sqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack_1/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack_1/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_3/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_3/dense_9/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_3/dense_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/embedding_3/Cast", "op": "Cast", "input": ["input_4"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/Shape", "op": "Shape", "input": ["input_4"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/embedding_3/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/embedding_3/Cast", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/embedding_3/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/similar_model_3/positional_embedding_3/Shape", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice/stack", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice/stack_1", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/mul", "op": "Mul", "input": ["StatefulPartitionedCall/similar_model_3/positional_embedding_3/embedding_3/embedding_lookup", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack_1/0", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack_1/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1", "op": "StridedSlice", "input": ["unknown_0", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack_1", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "1"}, "begin_mask": {"i": "6"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "4"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/add", "op": "AddV2", "input": ["StatefulPartitionedCall/similar_model_3/positional_embedding_3/mul", "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/similar_model_3/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/similar_model_3/positional_embedding_3/add", "StatefulPartitionedCall/similar_model_3/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/similar_model_3/dense_9/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/similar_model_3/Mean", "StatefulPartitionedCall/similar_model_3/dense_9/MatMul/ReadVariableOp", "StatefulPartitionedCall/similar_model_3/dense_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/similar_model_3/dense_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [1000, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/embedding_3/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/Sqrt", "shape": [], "dtype": "float32"}, {"name": "unknown_0", "shape": [2048, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack_1/0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack_1/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_3/positional_embedding_3/strided_slice_1/stack_2", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_3/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/similar_model_3/dense_9/MatMul/ReadVariableOp", "shape": [32, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/similar_model_3/dense_9/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}]}]}